Repository: zydpro/3almashe-game
Catalog: lib/Languages/app_*.arb
Languages: ar

# gameTitle
source: 3almaShe.com
ar: عالماشي .كوم

source: Play
ar: العب

source: Levels
ar: المراحل

source: Settings
ar: الإعدادات

source: About
ar: حول اللعبة

# store
source: Marketplace
ar: المتجر

source: Score
ar: النقاط

source: High Score
ar: أعلى نقاط

source: Coins
ar: العملات

source: Total Coins
ar: إجمالي العملات

source: Unlocked Levels
ar: المراحل المفتوحة

source: Current Level
ar: المرحلة الحالية

source: Target
ar: الهدف

source: Progress
ar: التقدم

source: Time
ar: الوقت

source: Lives
ar: الأرواح

source: Health
ar: الصحة

source: Shield
ar: الدرع

source: speed
ar: بعد انتهاء الإعلان ستعود للقائمة الرئيسية

source: slow
ar: بعد انتهاء الإعلان ستعود للقائمة الرئيسية

source: Slow Motion
ar: ابطاء الزمن

source: Double Points
ar: نقاط مزدوجة

source: Game Over
ar: انتهت اللعبة

source: Level Complete!
ar: اكتملت المرحلة!

source: Congratulations!
ar: تهانينا!

source: Well Done!
ar: أحسنت!

# bossWarning
source: Get ready! Boss is approaching...
ar: استعد! الزعيم يقترب...

# bossAppear
source: Boss appears!
ar: الزعيم يظهر!

source: Boss defeated!
ar: تم هزيمة الزعيم!

# resume
source: Resume Game
ar: استئناف اللعبة

# restart
source: Restart Game
ar: إعادة اللعبة

source: Restart Level
ar: إعادة المرحلة

source: Next Level
ar: المرحلة التالية

source: Main Menu
ar: القائمة الرئيسية

source: Levels Menu
ar: قائمة المراحل

source: Choose Level
ar: اختر المرحلة

# watchAdToContinue
source: Continue (Watch Ad)
ar: استمر (شاهد إعلان)

source: Loading Ad...
ar: جاري تحميل الإعلان...

# adPlaying
source: Playing Ad...
ar: يتم عرض الإعلان...

# shareOnly
source: Share
ar: مشاركة

# share
source: Share the game with your friends
ar: شارك اللعبة مع أصدقائك

# shareWithFriends
source: Try the fun game 3almaShe!\n\nDownload the game from the store and enjoy the challenge.
ar: جرب لعبة عالماشي الممتعة! حمل اللعبة من المتجر واستمتع بالتحدي.

source: Sound
ar: الأصوات

source: Music
ar: الموسيقى

source: Vibration
ar: الاهتزاز

source: Notifications
ar: الإشعارات

# SettingsStatistics
source: Game statistics
ar: إحصائيات اللعبة

# SettingsApplicationProcedures
source: Application procedures
ar: إجراءات التطبيق

# SettingsGameRating
source: Game Rating
ar: قيم اللعبة

# SettingsYourReview
source: Help us with your review in the store
ar: ساعدنا بتقييمك في المتجر

# SettingsShareWithFriends
source: Share the game with your friends
ar: شارك اللعبة مع أصدقائك

# SettingsResetData
source: Reset Data
ar: إعادة تعيين البيانات

# SettingsDeleteAllData
source: Delete all data and start over
ar: حذف جميع البيانات والبدء من جديد

# almaSheTeam
source: 3almaShe Team
ar: فريق عالماشي

source: Privacy Policy
ar: سياسة الخصوصية

source: Read our privacy policy
ar: اطلع على سياسة الخصوصية

source: Terms of Use
ar: شروط الاستخدام

source: Read the Terms of Use
ar: اطلع على شروط الاستخدام

source: Close
ar: إغلاق

# tutorialJump
source: Swipe up to jump
ar: اسحب للأعلى للقفز

# tutorialDuck
source: Swipe down to duck
ar: اسحب لأسفل للانحناء

# tutorialAttack
source: Tap to throw packages
ar: انقر لرمي الطرود

source: Combo!
ar: كومبو!

source: New Record!
ar: رقم قياسي جديد!

# flash
source: The yellow flash
ar: الوميض الأصفر!

# aboutGame
source: About the game
ar: حول اللعبة

# aboutGameSubject1
source: A fun endless runner game featuring the beloved character Al-Mashy. Avoid obstacles, collect points, and advance through different levels!
ar: لعبة جري لا نهائية ممتعة تتميز بشخصية عالماشي المحبوبة. تجنب العقبات، اجمع النقاط، وتقدم عبر المراحل المختلفة!

# aboutGameSubject2
source: This is an entertainment game affiliated with Syria's largest shopping website, Alamashi. You can visit our website and post your ads for free.
ar: هذه لعبة ترفيهية تابعة لموقع التسوق الأضخم في سوريا موقع عالماشي يمكنكم زيارتنا على الموقع ونشر إعلاناتكم مجانا

# VisitWebsite
source: :Visit us on our website
ar: زورونا على موقعنا:

source: Version:
ar: الأصدار:

source: Developer:
ar: المطور:

# aboutDesecration
source: Game Description
ar: وصف اللعبة

# aboutTheWebsite
source: Website
ar: الموقع الإلكتروني

# aboutLanguage
source: Language
ar: اللغة

# aboutOpenWebsite
source: 3almaShe website will open in your browser.
ar: سيتم فتح موقع عالماشي في المتصفح

# aboutCancel
source: Cancel
ar: إلغاء

# aboutOpenLink
source: Open Link
ar: فتح الرابط

source: Loading...
ar: جاري التحميل...

source: Loading Game...
ar: جاري تحميل اللعبة...

source: Loading Levels...
ar: جاري تحميل المراحل...

source: Error
ar: خطأ

source: Retry
ar: إعادة المحاولة

# adError
source: Failed to load ad
ar: فشل في تحميل الإعلان

source: Last Update
ar: آخر تحديث

# welcomeToGame
source: Welcome to
ar: مرحبًا بك في لعبة

# gameName
source: 3almaShe Run
ar: عالماشي اركض

source: We
ar: نحن

source: The Game
ar: اللعبة

source: Development Team
ar: فريق التطوير

# privacyPolicyIntro
source: We respect your privacy and strive to protect your data while using the game. This policy is prepared to clarify how data is collected, used, and protected.
ar: نحن نحترم خصوصيتك ونسعى لحماية بياناتك أثناء استخدامك للعبة. تم إعداد هذه السياسة لتوضيح طريقة جمع البيانات واستخدامها وحمايتها.

source: Data We Collect
ar: البيانات التي نجمعها

# privacyPoint1
source: The game does not request any direct personal information such as name or email, except in the following cases:
ar: اللعبة لا تطلب أي معلومات شخصية مباشرة مثل الاسم أو البريد الإلكتروني، إلا في الحالات التالية:

# privacyPoint2
source: When contacting technical support or sending feedback (you may optionally send your email).
ar: عند الاتصال بالدعم الفني أو إرسال ملاحظات (قد تُرسل بريدك الإلكتروني اختياريًا).

# privacyPoint3
source: General usage data (such as play time, score count, and reached level).
ar: بيانات الاستخدام العامة (مثل الوقت الذي تلعب فيه وعدد النقاط والمستوى الذي وصلت إليه).

# privacyPoint4
source: Anonymous advertising data used through services like Unity Ads or Google AdMob to improve ad experience.
ar: بيانات إعلانية مجهولة الهوية تُستخدم عبر خدمات مثل Unity Ads أو Google AdMob لتحسين تجربة الإعلانات.

source: Ads and Third Parties
ar: الإعلانات والجهات الخارجية

# adsPoint1
source: The game may contain ads from third parties like Unity Ads or Google AdMob.
ar: قد تحتوي اللعبة على إعلانات من أطراف ثالثة مثل Unity Ads أو Google AdMob.

# adsPoint2
source: These services may use anonymous identifiers (like ad IDs) to customize ads and analyze performance.
ar: تلك الخدمات قد تستخدم معرفات مجهولة (مثل معرف الإعلانات) لتخصيص الإعلانات وتحليل الأداء.

source: In-App Purchases
ar: المشتريات داخل اللعبة

# purchasesPoint1
source: If the game includes purchases (such as buying new characters or additional items), payment is processed through Google Play Store or Apple App Store.
ar: إذا تضمنت اللعبة عمليات شراء (مثل شراء شخصيات جديدة أو عناصر إضافية)، فإن الدفع يتم من خلال متجر Google Play أو Apple App Store.

source: Data Security
ar: أمان البيانات

# securityPoint1
source: We use digital protection means to reduce the risk of unauthorized access to game data.
ar: نستخدم وسائل حماية رقمية لتقليل خطر الوصول غير المصرح به إلى بيانات اللعبة.

# securityPoint2
source: However, there are no 100% secure online transmission or electronic storage methods, so we cannot guarantee absolute security.
ar: لكن لا توجد وسيلة نقل عبر الإنترنت أو تخزين إلكتروني آمنة بنسبة 100٪، لذا لا يمكننا ضمان الأمان المطلق.

source: Children Privacy
ar: خصوصية الأطفال

# childrenPoint1
source: The game is suitable for all ages, but we do not intentionally collect any personal data from children under 13 years old.
ar: اللعبة مخصصة لجميع الأعمار، لكننا لا نجمع عمدًا أي بيانات شخصية من الأطفال دون سن 13 عامًا.

# childrenPoint2
source: If you are a parent or guardian and believe your child has provided us with personal information, you can contact us to delete it immediately.
ar: إذا كنت والدًا أو وصيًا وتعتقد أن طفلك قد زودنا بمعلومات شخصية، يمكنك التواصل معنا لحذفها فورًا.

source: Policy Changes
ar: التغييرات على سياسة الخصوصية

# changesPoint1
source: We may update this policy from time to time.
ar: قد نقوم بتحديث هذه السياسة من وقت لآخر.

# changesPoint2
source: Any new updates will be published within the game or on its official page, with the "Last Update" date updated above.
ar: سيتم نشر أي تعديل جديد داخل اللعبة أو على صفحتها الرسمية، مع تحديث تاريخ "آخر تحديث" أعلاه.

source: Contact Us
ar: الاتصال بنا

# contactPoint1
source: If you have any questions or comments about the privacy policy, you can contact us via email:
ar: إذا كانت لديك أي أسئلة أو ملاحظات حول سياسة الخصوصية، يمكنك التواصل معنا عبر البريد الإلكتروني:

# termsAcceptance
source: Acceptance of Terms
ar: قبول الشروط

# termsLicense
source: License and Use
ar: الترخيص والاستخدام

# termsContent
source: In-Game Content
ar: المحتوى داخل اللعبة

# termsAds
source: Ads and External Services
ar: الإعلانات والخدمات الخارجية

# termsUpdates
source: Updates and Modifications
ar: التحديثات والتغييرات

# termsDisclaimer
source: Disclaimer
ar: إخلاء المسؤولية

# termsTermination
source: Termination
ar: إنهاء الاستخدام

# termsLaw
source: Governing Law
ar: القانون المعمول به

# rate
source: Game Rating
ar: تقييم اللعبة

# rateYouHappy
source: Do you enjoy playing 3lamasShe?
ar: هل تستمتع بلعبة عالماشي؟

# rateHelpUs
source: Help us with your review in the store!
ar: ساعدنا بتقييمك في المتجر!

source: Later
ar: لاحقاً

source: Rate Now
ar: قيم الآن

# resetWillDelet
source: Are you sure you want to delete all game data?\n\nAll points, coins, and unlocked levels will be lost.
ar: هل أنت متأكد من حذف جميع بيانات اللعبة؟\n\nسيتم فقدان جميع النقاط والعملات والمراحل المفتوحة.

# resetDone
source: Data has been successfully reset
ar: تم إعادة تعيين البيانات بنجاح

source: Delete
ar: حذف

# levelName1
source: The Beginning
ar: البداية

# levelName2
source: First Challenge
ar: التحدي الأول

# levelName3
source: Busy City
ar: المدينة المزدحمة

# levelName4
source: Dark Night
ar: الليل المظلم

# levelName5
source: The Storm
ar: العاصفة

# levelName6
source: Hot Desert
ar: الصحراء الحارة

# levelName7
source: Snowy Mountains
ar: الجبال الثلجية

# levelName8
source: Rainforest
ar: الغابة المطيرة

# levelName9
source: Raging Ocean
ar: المحيط الهائج

# levelName10
source: Outer Space
ar: الفضاء الخارجي

# levelName11
source: The Maze
ar: المتاهة

# levelName12
source: Ancient Castle
ar: القلعة القديمة

# levelName13
source: Volcano
ar: البركان

# levelName14
source: Secret Valley
ar: الوادي السري

# levelName15
source: Laboratory
ar: المختبر

# levelName16
source: Future City
ar: المدينة المستقبلية

# levelName17
source: Jurassic Park
ar: الحديقة الجوراسية

# levelName18
source: Lost Temple
ar: المعبد الضائع

# levelName19
source: Arctic Pole
ar: القطب الشمالي

# levelName20
source: Mysterious Desert
ar: الصحراء الغامضة

# levelDesc1
source: Learn the basics of the game
ar: تعلم أساسيات اللعبة

# levelDesc2
source: Faster and more obstacles
ar: عقبات أسرع وأكثر

# levelDesc3
source: Avoid crowds
ar: تجنب الحشود

# levelDesc4
source: Limited vision
ar: رؤية محدودة

# levelDesc5
source: Expert challenge
ar: تحدي الخبراء

# levelDesc6
source: High temperature
ar: حرارة عالية

# levelDesc7
source: Snow and cold
ar: ثلوج وبرودة

# levelDesc8
source: Rain and forests
ar: أمطار وغابات

# levelDesc9
source: Raging waves
ar: أمواج عاتية

# levelDesc10
source: Zero gravity
ar: انعدام الجاذبية

# levelDesc11
source: Intertwined paths
ar: طرق متشابكة

# levelDesc12
source: Historical atmosphere
ar: أجواء تاريخية

# levelDesc13
source: Volcanic lava
ar: حمم بركانية

# levelDesc14
source: Hidden secrets
ar: أسرار مخفية

# levelDesc15
source: Scientific experiments
ar: تجارب علمية

# levelDesc16
source: Advanced technology
ar: تكنولوجيا متطورة

# levelDesc17
source: Giant dinosaurs
ar: ديناصورات عملاقة

# levelDesc18
source: Ancient treasures
ar: كنوز قديمة

# levelDesc19
source: Eternal ice
ar: جليد أبدي

# levelDesc20
source: Desert legends
ar: أساطير الصحراء

# pauseTitle
source: Game Paused
ar: اللعبة متوقفة

# pauseResumeDesc
source: Continue the level from where you left off
ar: استكمال المرحلة من حيث توقفت

# pauseRestartDesc
source: Watch an ad then try again
ar: شاهد إعلان ثم حاول من جديد

# pauseMainMenuDesc
source: Watch an ad then return to main menu
ar: شاهد إعلان ثم ارجع للقائمة

# pauseLanguage
source: Language
ar: اللغة

# pauseAdRestart
source: After the ad ends, the level will restart
ar: بعد انتهاء الإعلان ستبدأ المرحلة من جديد

# pauseAdMainMenu
source: After the ad ends, you will return to main menu
ar: بعد انتهاء الإعلان ستعود للقائمة الرئيسية

# levelCompleteCongratulations
source: Congratulations!
ar: تهانينا!

# levelCompleteMessage
source: You have completed %s
ar: لقد أكملت %s

# levelCompleteUnlocked
source: Level %d unlocked
ar: تم فتح المرحلة %d

# gameOverSuccess
source: Well Done!
ar: أحسنت!

# gameOverLevelCompleted
source: Level completed successfully!
ar: تم إنجاز المرحلة بنجاح!

# gameOverCoinsEarned
source: Coins Earned
ar: العملات المكتسبة

# gameOverContinue
source: Continue (Watch Ad)
ar: استمر (شاهد إعلان)

# gameOverContinueDesc
source: Continue from where you left off
ar: استمر من حيث توقفت

# gameOverNextLevelDesc
source: Go to next level
ar: انتقل للمرحلة التالية

# gameOverRestartDesc
source: Try again
ar: حاول مرة أخرى

# gameOverLevelsDesc
source: Choose another level
ar: اختر مرحلة أخرى

# gameOverMainMenuDesc
source: Return to main menu
ar: العودة للقائمة الرئيسية

# gameOverAdTitle
source: Reward Ad
ar: إعلان مكافأة

# gameOverAdDesc
source: The game will continue after the ad ends
ar: ستستمر اللعبة بعد انتهاء الإعلان

# gameOverLoadError
source: Failed to load next level
ar: تعذر تحميل المرحلة التالية

# gameOverCongratulations
source: Congratulations!
ar: مبروك!

# gameOverAllLevelsCompleted
source: You have completed all levels!
ar: لقد أكملت جميع المراحل!

# gameOverChampion
source: You are the champion! 🏆
ar: أنت بطل اللعبة! 🏆

# gameOverAwesome
source: Awesome!
ar: رائع!

# tutorialTitle
source: New Control Method
ar: طريقة التحكم الجديدة

# tutorialDragHorizontal
source: Drag horizontally
ar: اسحب أفقياً

# tutorialDragHorizontalDesc
source: Move left and right
ar: تحريك لليمين واليسار

# tutorialDragUpSmall
source: Swipe up slightly
ar: اسحب للأعلى قليلاً

# tutorialDragUpSmallDesc
source: Small jump
ar: قفزة صغيرة

# tutorialDragUpLarge
source: Swipe up largely
ar: اسحب للأعلى بشكل كبير

# tutorialDragUpLargeDesc
source: High jump
ar: قفزة عالية

# tutorialDragDown
source: Swipe down while jumping
ar: اسحب للأسفل أثناء القفز

# tutorialDragDownDesc
source: Accelerate falling
ar: تسريع الهبوط

# tutorialFullControl
source: Move in any direction
ar: حرك في أي اتجاه

# tutorialFullControlDesc
source: Full control in movement
ar: تحكم كامل في الحركة

# tutorialTapAnywhere
source: Tap anywhere to continue playing!
ar: انقر في أي مكان لمتابعة اللعب!

# tutorialAutoHide
source: This tutorial will auto-hide after 6 seconds
ar: ستختفي هذه التعليمات تلقائياً بعد 6 ثواني

# bossNotification
source: ⚡ Boss is approaching!
ar: ⚡ الزعيم يقترب!

# gameSlogan
source: 3almaShe.com - The Battle in Your Hands
ar: عالماشي .كوم - المعركة بين يديك

# characterStore
source: Marketplace
ar: المتجر

# yourPoints
source: Your Coins
ar: العملات التي لديك

# buyPoints
source: Buy Coins
ar: شراء عملات جديدة

source: Watch Ad
ar: شاهد إعلان

# purchasedSuccessfully
source: Purchased
ar: تم الشراء

# insufficientPoints
source: Insufficient Coins
ar: عملات غير كافية

# watchAdForPoints
source: Watch ad to get 50 free Coins
ar: شاهد إعلان للحصول على 50 عملة مجانية

source: Select Character
ar: اختيار الشخصية

source: Character Selected
ar: تم اختيار الشخصية

# characterOwned
source: Owned
ar: مملوكة

# characterLocked
source: Locked
ar: مقفلة

# pointsPackage
source: Coins Package
ar: باقة العملات

# freePoints
source: Free Coins
ar: عملات مجانية

source: My Characters
ar: شخصياتي

source: Purchase Now
ar: اشتري الآن

source: Go to Store
ar: اذهب للمتجر

source: Owned Characters
ar: الشخصيات المملوكة

source: Available for Purchase
ar: متاحة للشراء

# noCharactersOwned
source: No characters owned yet
ar: لا تمتلك أي شخصيات بعد

source: All characters owned
ar: جميع الشخصيات مملوكة

source: Buy Coins Now
ar: اشتر عملات الآن

# choseCharacter
source: List of characters
ar: قائمة الشخصيات

# choseAnotherCharacter
source: Select another character from the list
ar: اختر شخصية أخرى من القائمة

source: Confirm Purchase
ar: تأكيد الشراء

# purchaseConfirmation
source: Do you want to purchase %s for %d coins?
ar: هل تريد شراء %s بـ %d نقطة؟

# characterAlreadyOwned
source: This character is already owned!
ar: هذه الشخصية مملوكة بالفعل!

# purchaseSuccess
source: ✅ Successfully purchased %s!
ar: ✅ تم شراء %s بنجاح!

# purchaseFailed
source: ❌ Failed to purchase character
ar: ❌ فشل في شراء الشخصية

source: Owned
ar: مملوكة

source: Selected ✓
ar: مختارة ✓

source: Buy Now
ar: اشتري الان

source: Select
ar: اختر

source: Characters
ar: الشخصيات

source: Loading characters...
ar: جاري تحميل الشخصيات...

source: No characters available
ar: لا توجد شخصيات متاحة

# characterLoadError
source: Error loading characters
ar: حدث خطأ في تحميل الشخصيات

# goToCharacters
source: 👥 Characters List
ar: 👥 قائمة الشخصيات

# watchAdForCoins
source: Watch ad to get 20 free coins
ar: شاهد إعلان للحصول على 20 عملة مجانية

# coinsAdded
source: 🎉 You got %d free coins!
ar: 🎉 حصلت على %d عملة مجانية!

# adFailed
source: ❌ Failed to load ad, please try again
ar: ❌ فشل تحميل الإعلان، حاول مرة أخرى

source: Buy Coins
ar: شراء عملات

source: Your Coins
ar: العملات التي لديك

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

source: Character Details
ar: تفاصيل الشخصية

# characterType
source: Type
ar: النوع

# characterAbilities
source: Abilities
ar: القدرات

# allCharactersPurchased
source: You've purchased all characters!
ar: لقد اشتريت جميع الشخصيات!

# goToMarketplace
source: 🛒 Go to Store
ar: 🛒 اذهب للمتجر
